RhinoInside.Revit API Documentation
GeometryDecoder.ToBrep Method (Solid)
 Converts the specified Solid to an equivalent Rhino Brep.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static Brep ToBrep(
	this Solid value
)
Parameters
value
Type: Solid
A value to convert.
Return Value
Type: Brep
A Rhino Brep that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Solid. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
ToBrep Overload
RhinoInside.Revit.Convert.Geometry Namespace